In [1]:
import pandas as pd
import numpy  as np

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|')

In [3]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [ ]:
df = df.set_index('user_id')

In [7]:
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [9]:
df['occupation'].nunique()

21

In [10]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [11]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [12]:
df['age'].mean()

34.05196182396607

In [18]:
df['age'].value_counts().sort_values(ascending = True).head()

73    1
7     1
11    1
10    1
66    1
Name: age, dtype: int64

In [20]:
pd.cut(df.age , 10).value_counts().sort_values(ascending = True).head()

(6.934, 13.6]     8
(66.4, 73.0]      8
(59.8, 66.4]     23
(53.2, 59.8]     36
(40.0, 46.6]     94
Name: age, dtype: int64